dataset_gen/Hole_Location_Change/CE_CRP_openfoam/Design_Point_0/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   nonuniform List<vector>
16320
(
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
(-0.643195292023452 -0.09631865471477208 0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            fixedValue;
         value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}
